In [1]:
#import libraries
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [2]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
        host = host_name,
        user = user_name,
        password = user_password
        )
        print('MySQL Database connection successful')
    except Error as err:
        print(f"Error: '{err}'")
    return connection
              
# Put out MySQL Terminal password
pwd = 'Original@465'
              
# Database name
db = 'AdMub' 
connection = create_server_connection("localhost",'root', pwd)

MySQL Database connection successful

In [46]:
!pip install mysql-connector-python

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: mysql-connector-python in c:\users\user\appdata\roaming\python\python310\site-packages (8.2.0)
Requirement already satisfied: protobuf<=4.21.12,>=4.21.1 in c:\users\user\appdata\roaming\python\python310\site-packages (from mysql-connector-python) (4.21.12)

In [3]:
# Create mysql_python 

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database create successfully")
    except Error as err:
        print(f"Error:'{err}'")
create_database_query = "Create database mysql_python"
create_database(connection, create_database_query)

Error:'1007 (HY000): Can't create database 'mysql_python'; database exists'

In [4]:
# connect to database

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            password = user_password,
            database = db_name
        )
        print("MySQL database connection successful")
    except Error as err:
        print(f"Error:'{err}'")
    return connection

In [5]:
# Execute sql queries

def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was successful")
    except Error as err:
        print(f"Error:'{err}'")

In [36]:
create_orders_table = """
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(20));
"""
# connect to database
connection = create_db_connection("localhost", "root", pwd, 'mysql_python')
execute_query(connection, create_orders_table)

MySQL database connection successful
Error:'1050 (42S01): Table 'orders' already exists'

In [37]:
# INSERT DATA 
data_orders = """
insert into orders values
(001, 'Yemi', 'Laptop', '2015-07-23', 6, 1500, '8145916352'),
(002, 'Daley', 'Stationeries', '2010-10-05', 14, 150, '7066502185'),
(003, 'Adimald', 'Clothes', '2020-09-20', 2, 230, '8068196181'),
(004, 'Adroq', 'Smart Tv', '2023-11-19', 1, 900, '8058077742'),
(005, 'Solad', 'Earpod', '2021-03-30', 3, 400, '7084083812'),
(006, 'Adhal', 'Shoes', '2022-10-16', 15, 2250, '55065612')
"""

# connect to database
connection = create_db_connection("localhost", "root", pwd, 'mysql_python')
execute_query(connection, data_orders)

MySQL database connection successful
Error:'1062 (23000): Duplicate entry '1' for key 'orders.PRIMARY''

In [38]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except:
        print(f"Error: '{err}'")

In [20]:
# Using the select statement
s1 = """
select * from orders;
"""
connection = create_db_connection("localhost", "root", pwd, 'mysql_python')
output = read_query(connection, s1)
for result in output:
    print(result)

MySQL database connection successful
(1, 'Yemi', 'Laptop', datetime.date(2015, 7, 23), 6, 1500.0, '8145916352')
(2, 'Daley', 'Stationeries', datetime.date(2010, 10, 5), 14, 150.0, '7066502185')
(3, 'Adimald', 'Clothes', datetime.date(2020, 9, 20), 2, 230.0, '8068196181')
(4, 'Adroq', 'Smart Tv', datetime.date(2023, 11, 19), 1, 900.0, '8058077742')
(5, 'Solad', 'Earpod', datetime.date(2021, 3, 30), 3, 400.0, '7084083812')
(6, 'Adhal', 'Shoes', datetime.date(2022, 10, 16), 15, 2250.0, '55065612')

In [22]:
# Using the select statement
s2 = """
select customer_name, date_ordered, phone_number from orders;
"""
connection = create_db_connection("localhost", "root", pwd, 'mysql_python')
output = read_query(connection, s2)
for result in output:
    print(result)

MySQL database connection successful
('Yemi', datetime.date(2015, 7, 23), '8145916352')
('Daley', datetime.date(2010, 10, 5), '7066502185')
('Adimald', datetime.date(2020, 9, 20), '8068196181')
('Adroq', datetime.date(2023, 11, 19), '8058077742')
('Solad', datetime.date(2021, 3, 30), '7084083812')
('Adhal', datetime.date(2022, 10, 16), '55065612')

In [30]:
# Using the select statement
s3 = """
select year(date_ordered) from orders;
"""
connection = create_db_connection("localhost", "root", pwd, 'mysql_python')
output = read_query(connection, s3)
for result in output:
    print(result)

MySQL database connection successful
(2015,)
(2010,)
(2020,)
(2023,)
(2021,)
(2022,)

In [31]:
# Using the select statement
s4 = """
select distinct year(date_ordered) from orders;
"""
connection = create_db_connection("localhost", "root", pwd, 'mysql_python')
output = read_query(connection, s4)
for result in output:
    print(result)

MySQL database connection successful
(2015,)
(2010,)
(2020,)
(2023,)
(2021,)
(2022,)

In [32]:
# Using the select statement
s5 = """
select * from orders where date_ordered > '2010-10-05';
"""
connection = create_db_connection("localhost", "root", pwd, 'mysql_python')
output = read_query(connection, s5)
for result in output:
    print(result)

MySQL database connection successful
(1, 'Yemi', 'Laptop', datetime.date(2015, 7, 23), 6, 1500.0, '8145916352')
(3, 'Adimald', 'Clothes', datetime.date(2020, 9, 20), 2, 230.0, '8068196181')
(4, 'Adroq', 'Smart Tv', datetime.date(2023, 11, 19), 1, 900.0, '8058077742')
(5, 'Solad', 'Earpod', datetime.date(2021, 3, 30), 3, 400.0, '7084083812')
(6, 'Adhal', 'Shoes', datetime.date(2022, 10, 16), 15, 2250.0, '55065612')

In [43]:
# Using the select statement
s6 = """
select * from orders order by unit_price desc;
"""
connection = create_db_connection("localhost", "root", pwd, 'mysql_python')
output = read_query(connection, s6)
for result in output:
    print(result)

MySQL database connection successful
(6, 'Adhal', 'Shoes', datetime.date(2022, 10, 16), 15, 2250.0, '55065612')
(1, 'Yemi', 'Laptop', datetime.date(2015, 7, 23), 6, 1500.0, '8145916352')
(4, 'Adroq', 'Smart Tv', datetime.date(2023, 11, 19), 1, 900.0, '8058077742')
(5, 'Solad', 'Earpod', datetime.date(2021, 3, 30), 3, 400.0, '7084083812')
(3, 'Adimald', 'Clothes', datetime.date(2020, 9, 20), 2, 230.0, '8068196181')
(2, 'Daley', 'Stationeries', datetime.date(2010, 10, 5), 14, 150.0, '7066502185')

In [47]:
# Using the select statement
s7 = """
select * from orders order by quantity asc;
"""
connection = create_db_connection("localhost", "root", pwd, 'mysql_python')
output = read_query(connection, s7)
for result in output:
    print(result)

MySQL database connection successful
(4, 'Adroq', 'Smart Tv', datetime.date(2023, 11, 19), 1, 900.0, '8058077742')
(3, 'Adimald', 'Clothes', datetime.date(2020, 9, 20), 2, 230.0, '8068196181')
(5, 'Solad', 'Earpod', datetime.date(2021, 3, 30), 3, 400.0, '7084083812')
(1, 'Yemi', 'Laptop', datetime.date(2015, 7, 23), 6, 1500.0, '8145916352')
(2, 'Daley', 'Stationeries', datetime.date(2010, 10, 5), 14, 150.0, '7066502185')
(6, 'Adhal', 'Shoes', datetime.date(2022, 10, 16), 15, 2250.0, '55065612')

In [50]:
from_db = []

for rslt in output:
    rslt = list(rslt)
    from_db.append(rslt)
    
column = ["order_id",'customer_name','product_name',
          'date_ordered','quantity','unit_price','phone_number']
df= pd.DataFrame(from_db, columns = column)

display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,4,Adroq,Smart Tv,2023-11-19,1,900.0,8058077742
1,3,Adimald,Clothes,2020-09-20,2,230.0,8068196181
2,5,Solad,Earpod,2021-03-30,3,400.0,7084083812
3,1,Yemi,Laptop,2015-07-23,6,1500.0,8145916352
4,2,Daley,Stationeries,2010-10-05,14,150.0,7066502185
5,6,Adhal,Shoes,2022-10-16,15,2250.0,55065612

In [51]:
# Update command

update = """
update orders
set unit_price = 600
where order_id = 2
"""

# connect to database
connection = create_db_connection("localhost", "root", pwd, 'mysql_python')
execute_query(connection, update)

MySQL database connection successful
Query was successful

In [52]:
# Using the select statement
s8 = """
select * from orders where order_id = 2;
"""
connection = create_db_connection("localhost", "root", pwd, 'mysql_python')
output = read_query(connection, s8)
for result in output:
    print(result)

MySQL database connection successful
(2, 'Daley', 'Stationeries', datetime.date(2010, 10, 5), 14, 600.0, '7066502185')

In [53]:
# Using the select statement
s9 = """
select * from orders ;
"""
connection = create_db_connection("localhost", "root", pwd, 'mysql_python')
output = read_query(connection, s9)
for result in output:
    print(result)

MySQL database connection successful
(1, 'Yemi', 'Laptop', datetime.date(2015, 7, 23), 6, 1500.0, '8145916352')
(2, 'Daley', 'Stationeries', datetime.date(2010, 10, 5), 14, 600.0, '7066502185')
(3, 'Adimald', 'Clothes', datetime.date(2020, 9, 20), 2, 230.0, '8068196181')
(4, 'Adroq', 'Smart Tv', datetime.date(2023, 11, 19), 1, 900.0, '8058077742')
(5, 'Solad', 'Earpod', datetime.date(2021, 3, 30), 3, 400.0, '7084083812')
(6, 'Adhal', 'Shoes', datetime.date(2022, 10, 16), 15, 2250.0, '55065612')

In [56]:
# Delete command

delete_order = """
delete from orders
where unit_price =600
"""

# connect to database
connection = create_db_connection("localhost", "root", pwd, 'mysql_python')
execute_query(connection, delete_order)

MySQL database connection successful
Query was successful

In [57]:
# Using the select statement
s10 = """
select * from orders ;
"""
connection = create_db_connection("localhost", "root", pwd, 'mysql_python')
output = read_query(connection, s10)
for result in output:
    print(result)

MySQL database connection successful
(1, 'Yemi', 'Laptop', datetime.date(2015, 7, 23), 6, 1500.0, '8145916352')
(3, 'Adimald', 'Clothes', datetime.date(2020, 9, 20), 2, 230.0, '8068196181')
(4, 'Adroq', 'Smart Tv', datetime.date(2023, 11, 19), 1, 900.0, '8058077742')
(5, 'Solad', 'Earpod', datetime.date(2021, 3, 30), 3, 400.0, '7084083812')
(6, 'Adhal', 'Shoes', datetime.date(2022, 10, 16), 15, 2250.0, '55065612')